[
  {
    "index": 0,
    "name" : "Szechwan Chilli Chicken",
    "servings": "Serves 8",
    "totalTime": "45 minutes",
    "ingredients": "2-3 Spring Onions, chopped\n5-6 Dry Red Chillies (deseeded), chopped\n2-3 Tbsp Ginger, chopped\n3 Tbsp Brown Pepper Corn\n3 Tbsp Green Pepper Corn\n10-12 Pieces Chicken (with bone)\n1 tsp Ajinomoto (optional)\nSalt\n2 tsp White Pepper\nOil\n1 Tbsp Black Vinegar\n2 tsp Chilli oil",
    "procedure": "Flash fry the chicken with ginger till there colour changes to golden. Now, drain the oil and keep this aside. Now, add garlic, spring onions green pepper corns and the brown peppercorn. Stir for 5 minutes and then add the dry chillies, white pepper powder, ajino moto, salt and chilli oil. Stir again for 5-10 minutes and add the black vinegar. Stir fry for 10 minutes and garnish with green peppercorns. Szechwan chilli chicken is ready to be served."
  },
  {
    "index": 1,
    "name" : "Chicken Manchurian",
    "servings": "Serves 4",
    "totalTime": "80 minutes",
    "ingredients": "250 Gram Chicken mince\n2 Eggs (slightly beaten)\n3/4 Cup Refined flour\n1/2 tsp Garlic paste\n1/2 tsp Ginger paste \nOil\n2 Tbsp Oil\n1 tsp Garlic, finely chopped\n1/2 Cup Onions, finely chopped\n1 Large Capsicum, finely chopped\nFor sauce, mix together:\n3 Tbsp Corn flour (blended)\n1/2 Cup Water\n2 Tbsp Vinegar\n2 tsp Salt\n2 tsp Soya sauce\n1/2 Cup Tomato puree\n2 Tbsp Celery, chopped\n2 Cups Water",
    "procedure": "Mix together the chicken, egg, flour, garlic and ginger paste, enough water so as to have a thick batter. Leave this for 5-10 minutes. Heat the oil, keeping the heat high drop heaped teaspoonfuls of batter and fry to a golden brown. Drain on absorbent paper till required. Heat 2 Tbsp of oil, and stir-fry the garlic and onion in it over high heat, till the onions look glossy. Add the capsicum and turn around a few times. Add the sauce mixture, and simmer till the sauce thickens and becomes translucent. Add the fried balls, turn around a few times and serve."
  },
  {
    "index": 2,
    "name" : "Chicken Cantonese Soup",
    "servings": "Serves 4",
    "totalTime": "40 minutes",
    "ingredients": "1 breast of chicken - de-boned and cubed\n1 spring onion - chopped fine\n1/2 cup finely shredded cabbage\n1/4 cup finely shredded carrots\n1 tbsp finely chopped celery\n5 cups chicken stock\n3 Tbsp cornflour\n1/2 cup water to dissolve cornflour\n1 tsp salt or to taste\n1 tsp soya sauce\n1/2 tsp chilli sauce\n1 Tbsp vinegar or to taste",
    "procedure": "Put stock in a sauce pan, place over high heat and bring to a boil. Add chicken pieces and simmer for about 10 minutes. Add the cornflour mixture and cook till the chicken is tender. Add the onions, carrots, celery, salt, soya sauce, chilli sauce and vinegar and simmer for 2-3 minutes and serve."
  },
  {
    "index": 3,
    "name" : "Vegetable Momos",
    "servings": "Serves 10",
    "totalTime": "50 minutes",
    "ingredients": "For Dough:\n2 cups flour\n1/2 tsp salt\n1/2 tsp baking powder\n\nFor Filling:\n1 cup carrots, grated\n1 cup cabbage, grated\n1 tbsp oil\n1/2 cup onion, finely chopped\n1 tsp garlic, chopped\n1 tsp soya sauce\nSalt\n1/4 tsp vinegar\n1/4 tsp black pepper",
    "procedure": "Mix the flour, salt and baking powder and knead to a stiff dough with water. Heat oil and add the onion and garlic. Saute over high heat and add the carrot and cabbage. Turn around over high heat till glossy. Take it off the heat and mix in the soya sauce, salt, vinegar and black pepper. Roll the dough thin (translucent) and cut into 4-5 rounds. Take a round, wet edges and place some filling in the center. Bring edges together to cover the filling. Twist to seal and fill the rest in the same way. Steam for about 10 minutes and serve with soya sauce and chilli sauce."
  },
  {
    "index": 4,
    "name" : "Vegetable Chopsuey",
    "servings": "Serves 2",
    "totalTime": "50 minutes",
    "ingredients": "1/2 Cup Carrots, shredded\n1 Cup Cabbage , shredded\n1/2 Cup Capsicums , shredded\n1/2 Cup Onions , sliced\n2 tsp Garlic, finely chopped\n2 Tbsp Oil\n200 Gram Noodles (drained well), boiled\n2 Tbsp Vinegar\n1/2 tsp Soya sauce\n1 tsp Sugar\nSalt\n2 Tbsp Cornflour\nOil",
    "procedure": "Mix together the vinegar, soya sauce, sugar, salt and cornflour and add enough water to make up to a cup. Keep aside. Heat the 2 Tbsp oil and add the onions and garlic. Saute till a little soft. Add the carrots, cabbage and capsicum and stir-fry over high heat for a minute. Add the water mixture and cook, stirring continuously. Keep aside. Deep fry the noodles over high heat till brown. Drain. Transfer noodles to a serving dish, pour the vegetables over and serve."
  },
  {
    "index": 5,
    "name" : "Vegetable Hakka Noodles",
    "servings": "Serves 2",
    "totalTime": "30 minutes",
    "ingredients": "Noodles\n1 tsp Salt\n1 tsp Oil\n1 tsp Garlic paste\n1 tsp Ginger paste\n1/2 Cup Beans\n1/2 Cup Cabbage, chopped\n1/2 Cup Carrot, chopped\n1/2 Cup Spring onion, chopped\n1/2 Cup Capsicum, chopped\n2 Tbsp Soy sauce\n2 Tbsp Green chilli sauce\n1 Tbsp Tomato sauce",
    "procedure": "Boil the noodles in a pan till it starts to simmer. Add salt and some oil to the boiling noodles. When the noodles start to e a little sticky, drain the excess water and wash them in cold water. In another pan, heat about 3 teaspoon of oil. Put ginger paste followed by garlic paste. Saute them well till golden brown. Now add all the vegetables to the pan. Saute them well and add soy sauce, green chilli sauce and tomato sauce. Mix them well and now add the boiled noodles to them. Mix them thoroughly with the vegetables. Serve hot."
  }
]