[
  {
    "index": 0,
    "name" : "Grilled Polenta with Spinach and Robiola Cheese",
    "servings": "Serves 4",
    "totalTime": "50 minutes",
    "ingredients": "2 tablespoons extra-virgin olive oil, plus more for brushing \nSalt \n1 cup instant polenta \n2 large garlic cloves, thinly sliced \n1 pound baby spinach \nFreshly ground pepper \n1/4 pound robiola cheese, cut into 8 slices, at room temperature",
    "procedure": "Lightly oil a 9-inch round glass baking dish. In a medium saucepan, bring 3 cups of water to a boil. Add 1 1/2 teaspoons of salt and slowly whisk in the polenta. Cook over low heat, whisking constantly, until the polenta is thick, about 5 minutes. Pour the hot polenta into the baking dish and cover the surface directly with plastic wrap. Let stand until firm, about 25 minutes.\nIn a large, deep skillet, heat the 2 tablespoons of olive oil. Add the garlic and cook over moderate heat until golden brown, about 30 seconds. Increase the heat to moderately high and add the spinach, stirring to wilt it. Season with salt and pepper. Keep the spinach warm.\nLight a grill and oil the grates. Cut the polenta into 8 wedges and grill over moderately high heat until crisp and lightly charred, 5 minutes per side. Place 2 wedges on each plate; top each with 2 robiola slices. Spoon the warm spinach on top and serve."
  },
  {
    "index": 1,
    "name" : "Italian Sweet-and-Sour Chicken",
    "servings": "Serves 4",
    "totalTime": "60 minutes",
    "ingredients": "One 4-pound chicken, cut into 10 pieces (each breast split crosswise) \nSalt and freshly ground pepper \n1/4 cup extra-virgin olive oil \n1 large onion, cut into 1/2-inch dice \n2 carrots, halved lengthwise and sliced crosswise \n1/4 inch thick 2 celery ribs, cut into 1/2-inch dice \n8 garlic cloves, peeled \n1/4 cup sugar \n1 cup dry light-bodied red wine, such as Chianti \n1/2 cup red wine \nvinegar \n1/2 cup fresh orange juice \n2 tablespoons capers, drained \n1/4 cup sliced almonds",
    "procedure": "Season the chicken with salt and pepper. In a large, deep skillet, heat 2 tablespoons of the olive oil. Add the chicken and cook over moderately high heat until browned, about 4 minutes per side. Transfer the chicken to a plate and pour off the oil.\nAdd the remaining 2 tablespoons of olive oil to the skillet and add the onion, carrots, celery and garlic. Cook over moderate heat, stirring occasionally, until starting to brown, about 8 minutes. Add the sugar, wine, vinegar, orange juice, capers and almonds and bring to a boil. Return the chicken to the skillet, skin side up. Cover partially and simmer over low heat until the chicken is cooked through, about 35 minutes.\nTransfer the chicken to a plate. Boil the pan sauce over high heat until thickened, about 3 minutes. Season the sauce with salt and pepper. Return the chicken to the skillet until warmed through. Transfer to a plate, spoon the sauce on top and serve."
  },
  {
    "index": 2,
    "name" : "Whole-Wheat Fettuccine with Arugula Pesto",
    "servings": "Serves 4",
    "totalTime": "60 minutes",
    "ingredients": "3/4 cup whole-wheat flour \n3/4 cup all-purpose flour \nSalt \n3 large egg yolks \n1/3 cup water \n1/3 cup plus 1 teaspoon extra-virgin olive oil \n2 tablespoons pine nuts \n2 packed cups baby arugula (2 ounces) \n1/4 cup freshly grated Parmigiano-Reggiano cheese \n1 garlic clove, chopped \n1 cup halved cherry tomatoes",
    "procedure": "In a food processor, pulse the whole-wheat and all-purpose flours with 1/2 teaspoon of salt. In a bowl, whisk the egg yolks, water and the 1 teaspoon of oil. With the processor on, add the egg yolk mixture and process until a ball forms. Transfer the dough to a work surface and knead until smooth. Cover with plastic wrap and let stand at room temperature for 20 minutes. Wipe out the processor.\nIn a small skillet, toss the pine nuts over moderate heat until toasted, 1 minute; let cool. In the food processor, pulse the arugula, pine nuts, cheese, garlic and the remaining 1/3 cup of oil to a paste. Season the pesto with salt and add to a large skillet.\nCut the dough into 3 pieces; work with 1 piece at a time and keep the rest covered. Flatten the dough slightly and run it through progressively narrower settings in a pasta machine until you reach the thinnest setting. Cut the pasta into 10-inch lengths. Using the pasta machine, cut each length into fettuccine. Transfer to a baking sheet, leaving space between the pasta so it doesn’t stick.\nIn a pot of boiling, salted water, cook the pasta, stirring, until al dente, about 30 seconds. Drain the pasta, reserving 1/3 cup of the cooking water. Stir the reserved water into the pesto. Add the pasta and tomatoes to the pesto, toss over moderate heat and serve."
  },
  {
    "index": 3,
    "name" : "Grilled Eggplant Parmesan",
    "servings": "Serves 4",
    "totalTime": "45 minutes",
    "ingredients": "1 large eggplant (1 1/2 pounds), peeled and sliced crosswise 1/4 inch thick \n4 large plum tomatoes, sliced crosswise 1/4 inch thick \nExtra-virgin olive oil, for brushing \nSalt \n1/3 cup chopped green olives \n1 to 2 tablespoons chopped oil-packed Calabrian chiles or other hot chiles \n1/4 cup finely shredded basil, plus whole leaves for garnish \n6 ounces Fontina cheese, thinly sliced \nCrusty bread, for serving",
    "procedure": "Preheat the oven to 450° and heat a grill pan. Brush the eggplant and tomato slices with olive oil and season lightly with salt. Grill the eggplant in batches over moderately high heat, turning once, until softened and lightly charred, about 4 minutes. Grill the tomatoes, turning once, until lightly charred but still intact, about 2 minutes.\nIn a bowl, combine the olives, chiles and shredded basil. Line a large rimmed baking sheet with parchment paper. In the center, arrange half of the eggplant in a 9-inch square, overlapping the slices slightly. Top with half of the grilled tomatoes, olive mixture and Fontina. Repeat with the remaining ingredients, ending with the cheese.\nBake in the center of the oven for about 15 minutes, until bubbling and golden. Let stand for 10 minutes. Garnish with basil leaves and serve with crusty bread."
  },
  {
    "index": 4,
    "name" : "Authentic Pizza Margherita",
    "servings": "Serves 4",
    "totalTime": "105 minutes",
    "ingredients":"3 1/2 cups all-purpose flour\n1 teaspoon salt\n1 cup water\n1 (.25 ounce) package active dry yeast\n1 pinch white sugar\n1/4 cup flour for dusting\n2 cups pizza sauce\n20 slices fresh mozzarella cheese\n20 leaves fresh basil\nOlive oil\nSea salt",
    "procedure":"Stir flour and 1 teaspoon salt in a bowl. Set aside. Mix water, yeast, and sugar in a large bowl. Let stand until yeast begins to form a creamy foam, about 5 minutes. Stir half the flour mixture into yeast mixture until no dry spots remain. Stir in remaining flour, 1/2 cup at a time, mixing well after each addition. When dough pulls together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, then place dough in the bowl and turn to coat with oil. Cover with a light cloth and let rise in a warm place (80 to 95 degrees F (27 to 35 degrees C)) until doubled in volume, about 1 hour. Punch dough down, divide into 4 equal pieces, and form each into a ball. Preheat oven with a pizza stone to 500 degrees F (260 degrees C). Stretch out and pat 1 dough ball to form a circle 10 to 12 inches in diameter. Place dough on a lightly floured pizza peel. Top with 1/2 cup of tomato sauce and spread to cover within an inch of the edge of the dough. Arrange 5 slices of mozzarella cheese on top of the tomato sauce, then place 5 basil leaves on top. Drizzle pizza with 1 tablespoon olive oil and sprinkle with sea salt to taste. Repeat for 3 remaining dough balls.Slide each pizza onto the pizza stone in the preheated oven. Bake until cheese is bubbly and the underside of the crust is golden brown, 5 to 7 minutes."
  }
]