[
  {
    "index": 0,
    "name" : "Aloo Paratha",
    "servings": "Serves 6",
    "totalTime": "35 minutes",
    "ingredients":"7 mashed,boiled,peeled potato \n1 handful chopped coriander leaves\n4 tablespoon melted butter\n1 1/2 tablespoon salt\n1 tablespoon chaat masala\n4 finely chopped green chilli\n1/2 teaspoon powdered black pepper\n1 large finely chopped onion\n1 tablespoon red chilli\n1/2 tablespoon garam masala powder\n2 cup wheat flour\n1/2 cup water",
    "procedure": "To make this paratha recipe, boil the potatoes and mash them in a large bowl. In the potatoes, add chopped onions, green chillies, coriander leaves, salt, garam masala powder, chaat masala and mix well so that no lumps remain. Ensure that you have finely chopped the onions or the filling will come out.Put wheat flour in a large mixing bowl. Add water gradually and knead into a soft dough. Make small-medium balls of the dough and roll them out into 3 to 4 inch circles. Add a spoonful of potato filling in the centre. Gradually press the rolling pin on all sides while making the parathas. Be very careful to apply pressure evenly. It is very important to insure that your potato mixture is mashed well and not lumpy or you will never be able to make perfect parathas.Seal the dough and round it with the your fingers. Now roll them with a rolling pin into round parathas. Apply the pressure very evenly and gently on all sides.Press very lightly so that the mixture does not come out. Heat a girdle and roast the parathas, cooking them on both the sides with a spoonful of butter. If you want to use less butter on the parathas, first roast them on both the sides on low flame and when they are slightly crispy, apply butter with brush on both the sides.Serve piping hot with chilled yogurt,pickle,green chutney,coconut chutney or a light gravy. Ideally a light potato shorba goes best with aloo ka paratha. "
  },
  {
    "index": 1,
    "name": "Aloo Gobi",
    "servings": "Serves 4",
    "totalTime": "45 minutes",
    "ingredients": "1 medium sized cauliflower\n2 medium sized potatoes\n1 Inch Piece of Ginger, finely chopped\n1-2 green chilies, finely chopped\n1 teaspoon cumin seeds\n1/2 teaspoon turmeric Powder\n1 Teaspoon Red Chili Powder\nSalt according to taste\n1/2 teaspoon garam masala powder\n1 pinch asafoetida\n1/2 Cup coriander leaves\n1 tablespoon oil",
    "procedure": "Take a cauliflower and cut it into medium sized florets. Wash and rinse them thoroughly and drain all the water in a colander.Peel and dice the potatoes into cubes.Heat oil in a pan,add cumin Seeds and fry them till they start to splutter. Add 1 pinch of asafoetida.Then add finely chopped ginger and green chillies.Cook them for a few seconds.Then add 1/2 teaspoon turmeric Powder, 1 teaspoon red chilli powder and salt according to taste.Add the diced potato & cauliflower florets to the pan.Mix to coat the vegetables with the spices. Then cover the pan with a lid and cook the vegetables on low heat.Stir occasionally till the potatoes turn soft, for about 15 minutes.Stir occasionally till the potatoes turn soft, for about 15 minutes.After the vegetables are cooked add garam masala powder.Mix well and cook for another 2 minutes. Turn off the heat and and freshly chopped coriander leaves.Aloo Gobi Curry is ready. Serve it hot with Roti/Paratha and Boondi Raita or with Rice and Dal."
  },
  {
    "index": 2,
    "name": "Chole Bhature",
    "servings": "Serves 4",
    "totalTime": "80 minutes",
    "ingredients": "For chole:\n\n2 cup chickpeas\n2 tsp oil\n1 Bay leaf\n1 Cinnamon stick\n3-4 Cloves\n1 tsp whole pepper corns\n3 Green cardamom (choti elaichi)\n2 Black cardamom (badi elaichi)\n1 tsp rurmeric powder\n1 tsp chili powder \n1 tsp coriander powder (dhaniya powder)\n1 tsp cumin powder (zeera powder)\n1 tsp cumin seeds (zeera)\n1/2 tsp asafoetida (heeng)\nSalt\n1 cup onions, chopped\n1 cup tomatoes, chopped\n1 tsp ginger, chopped\n1 tsp garlic, chopped\n1 tsp ajwain\n1 tsp lime juice\n1 green chili, chopped\n1 Tea bag\n1 tbsp butter\n\nFor the bhaturas:\n\n2 cups maida (refined flour)\n1/2 tsp yeast (dissolved for 10 minutes in luke warm water)\n1/2 cup whole wheat flour\nA pinch of salt\nWater\nOil ",
    "procedure": "Prepare chole:\n\nIn a pan add oil, bay leaf, cinnamon, cumin seeds, cloves, whole pepper corns, green and black cardamom. After it gets brown add chopped onions and saute it. Now add chopped ginger and garlic. Followed by turmeric, chili powder, coriander powder, cumin powder, asafoetida and salt, fry the ingredients together well. For de glazing the pan add a little water. Now add the chole (soaked overnight and pressure cooked) to the masala. After stirring well add tomatoes, little sugar and salt to the chole. Now add ajwain, chopped green chilies and water for the base. To get the color in the chole, add a tea bag to the masala. Simmer the chole gently for an hour and cover it.Add lime juice and a dollop of butter to it.Garnish the chole with coriander and butter and serve them hot with bhaturas.\n\nPrepare the bhaturas:\n\nKnead the whole wheat flour, maida and salt together with adequate amount of water.\nSprinkle the yeast on top. Leave it for 2-3 hours for the yeast to work.\nDivide it into equal portions. Roll out in an oval or round shape. Deep fry till golden brown, like a puri. Serve."
  },
  {
    "index": 3,
    "name": "Butter Chicken",
    "servings": "Serves 4",
    "totalTime": "50 minutes",
    "ingredients": "400 gms raw chicken\n\nFor the Marinade:\n2 tsp red chilli powder\n2 tsp ginger and garlic paste\n2 tsp salt\n2 tsp lemon juice\nCurd\n1/2 tsp garam masala\n1 tsp kasuri methi\n2 tsp mustard oil\n\nFor gravy:\n2 tsp oil\n2 to taste butter cubes\n3 gram Cloves\n1 Cinnamon sticks, sliced\n1 tsp Mace\n7 Cardamom\n4 Tomatoes, chopped\n1 tsp garlic\n1 tsp ginger\n2 butter cubes\n1 tsp ginger garlic paste\n1 1/2 tsp red chilli powder\n1 tsp kasuri methi\n2 tsp honey\n1 green chilli\n2 tsp cardamom powder\n1 tbsp cream",
    "procedure": "For marination:\nIn a mixing bowl, put raw chicken pieces and add salt, red chilli powder, ginger garlic paste and lemon juice. Mix well. Refrigerate for about 15-20 minutes. Now add curd to the refrigerated mix. Followed by salt, ginger garlic paste, red chilli powder, garam masala, kasuri methi and mustard oil. Mix well and refrigerate again for an hour. Roast the marinated chicken in an oven for about 30 minutes until it is three-fourth done.\n\nPrepare the chicken gravy: \nHeat 2 tsp of oil in a pan with butter. Add cloves, cinnamon stick, mace and cardamom. Saute and then add chopped tomatoes, garlic and ginger. Mix well and then grind well. In another pan, heat another two cubes of butter, along with ginger garlic paste. Add the tomato puree made from the mixture. Now add red chilli powder, kasuri methi, honey and finally the roasted chicken pieces. Let it simmer. Add green chilli, cardamom powder and cream. Mix well. Serve with a teaspoon of cream over."
  },
  {
    "index": 4,
    "name": "Dal Makhani",
    "servings": "Serves 4",
    "totalTime": "50 minutes",
    "ingredients": "2 Cups Sabut Urad Dal\n8 Cups Water\n2 Tbsp Salt\n1 Tbsp Ginger, sliced\n2 Tbsp Butter\n1 Tbsp Oil\n2 tsp Shahi Jeera\n1 tsp Kasoori Methi\n2 Cups Tomato puree\n1 tsp Chilli powder\n1 tsp Sugar\n1.5 Cups Cream\nGreen chillies",
    "procedure": "Clean, wash and soak the Dal overnight. Next day, drain and add salt, red chilli powder and ginger paste to the dal along with 2 cups of water. Cook the dal until it becomes tender. Now take a pan, pour some oil and butter and heat together. Add cumin seeds, mix thoroughly and when it starts to splutter pour tomato puree in it. When it starts boiling, add sugar, salt and red chilli powder. Stir-fry over high flame till the oil separates. Add boiled dal and cook further. The consistency should be such that the dal should move around freely when stirred, otherwise add a little water.Homemade Dal Makhani Leave it to simmer, covered. Remove the lid and add Garam Masala. Stir well. Add cream to the boiling Dal. Mix it well. Garnish with green chillies and serve hot."
  },
  {
    "index": 5,
    "name": "Rajma Chawal",
    "servings": "Serves 4",
    "totalTime": "60 minutes",
    "ingredients": "1 cup red kidney beans\n2 large onion\n1 teaspoon ginger\n1 tablespoon coriander powder\n1 tablespoon powdered black pepper\n1 cinnamon stick\n2 green cardamom\n2 clove\n3 tablespoon mustard oil\n2 large tomato\n1 cup rice\n1 tablespoon garlic\n2 chopped green chilli\n1 tablespoon cumin powder\nSalt\n1 tablespoon garam masala powder\n1 black cardamom\n1 tablespoon black pepper\n1 tablespoon ghee",
    "procedure":"Wash the rajma and allow it to soak in water overnight. Wash it again and pressure cook with 2 cups of water, salt and turmeric. Once the rajma is soft and squishy remove it from fire and keep it aside. Finely chop onions and keep aside, grate the tomatoes and keep them aside. Make a paste of ginger,garlic and green chillies. In a deep bottomed pan, add oil, when it gets heated add green cardamom, black cardamom, cinnamon, clove, peppercorn. Once they become fragrant, add onions and cook till they are golden brown. Now add the tomatoes and cook on high for 4-5 minutes. Add ginger- garlic-chilli paste, cumin powder, coriander powder and black pepper powder. Cook till the spices become fragrant and oil starts leaving the sides of the pan. Now add the rajma and one cup of water. Mix well and cook covered for 10 minutes. Once done, add the ghee. You can garnish with coriander leaves. Your rajma is ready. To make a steamed rice, boil 1 cup rice with 5 cups of water. Once the rice is soft, strain and discard the water. Spread the rice on a plate and allow it to air for 2-3 minutes."
  },
  {
    "index": 6,
    "name": "Fried Fish Amritsari",
    "servings": "Serves 4",
    "totalTime": "18 minutes",
    "ingredients": "1 kilogram fish (any fish with firm, white flesh) cut into medium-thick slices\n3 tablespoons ginger paste\n3 tablespoons garlic paste\n1 teaspoon turmeric powder\n1 teaspoon coriander powder\n1 teaspoon cumin powder\n1 teaspoon carom seeds (ajwain)\n1 teaspoon chili powder\nSalt\n2 tablespoons lime juice (juice of 1 lime)\n1 1/2 cups Bengal gram flour\nOil to shallow fry fish\nJuice of 1 lemon\n1 lime (wedged)",
    "procedure": "Mix all the ingredients except the fish and lime wedges, in a large, shallow dish. Form a thick paste. Gently fold the fish into this paste, making sure to coat each piece well. Allow to marinate for 1 hour. In a wide, flat pan, heat enough oil to shallow fry the fish till each piece is golden and crisp on both sides. Serve hot, arranged in a platter. Squeeze lemon juice over the pieces just before serving. Garnish with lime wedges."
  },
  {
    "index": 7,
    "name": "Lachcha Paratha",
    "servings": "Serves 6-8",
    "totalTime": "30 minutes",
    "ingredients": "2 cups whole wheat flour\n3/4 cup water (or more, as needed) to make the dough\nSalt to taste\n1 cup ghee",
    "procedure": "Mix the flour and salt and knead into a soft dough with a little water at a time. Set aside. Mix 3 tablespoons ghee with 1 tablespoon flour, and set aside. Divide the dough into equally sized balls. Divide each ball into 2 portions. Take each portion and roll into a long, finger-thick noodle shape. Coil the first shape into a spiral. Flour a rolling surface lightly and very gently roll out the spiral into a flat circle about 5 inches in diameter (1/3 thick). Grease the top surface with the ghee-flour mix. Roll the next shape in the same way and place over the first circle. This makes one Lachcha Paratha. Repeat with the remaining dough. Heat a flat pan on medium heat. Fry each paratha as follows: After placing it on the pan the first time, turn after 30 seconds. Spread ghee on the top surface and turn again. Grease the side now on top. Turn often and fry until crisp and golden.Serve hot with preferred dip."
  },
  {
    "index": 8,
    "name": "Matar Paneer",
    "servings": "Serves 4-6",
    "totalTime": "45 minutes",
    "ingredients": "2 large onions (cut into quarters)\n3 medium-sized tomatoes (cut into quarters)\n6 tablespoons vegetable oil (or canola or sunflower cooking oil, divided)\n1 pound paneer (cubed)\n1 tablespoon ginger paste\n2 tablespoons garlic paste\n2 teaspoons coriander powder\n1 teaspoon cumin powder\n1/2 tsp turmeric powder\n2 teaspoons garam masala\n2 green chillies (finely chopped)\n1/2 pound shelled peas\n1 1/2 cups water (hot)\nSalt (to taste)\n3 tablespoons heavy cream\nGarnish: 1/3 cup fresh coriander leaves (finely chopped)",
    "procedure" : "Grind the onions into a fine paste in a food processor. Keep aside. Next grind tomatoes into a fine paste and keep aside. Heat 2 to 3 tablespoons of the vegetable oil in a deep pan and gently stir-fry the cubes of paneer till golden. When golden, remove onto a paper towel and keep aside. In the same vessel, heat the remaining 2 to 3 tablespoons of the vegetable oil and add the onion paste. Fry till it turns light brown. You will need to stir frequently to avoid the paste burning. Also, do not over-fry as it will turn bitter and ruin the curry. Another hassle-free way to do this is to chop the onions fine and then sauté till pale golden, then grind in the food processor. When the onion paste is fried, add tomato paste, ginger and garlic paste, and sauté for another 2 minutes. Next, add the coriander, cumin, turmeric, and garam masala powders, and the finely chopped green chilies and sauté, stirring continuously, till the cooking oil begins to separate from the masala (spice mixture). Now add the peas to the masala and fry for 2 to 3 minutes. Then add the previously fried paneer, hot water, and salt, to taste, reduce the heat to a simmer and cook till the gravy thickens. When the gravy is as thick as you would like, turn off the heat and stir in the cream. Garnish with coriander leaves and serve."
  }
]