[
  {
    "index": 0,
    "name" : "Appam: Rice And Coconut Pancake",
    "servings": "Serves 5",
    "totalTime": "25 minutes",
    "ingredients": "1 cup rice\n2 cups dessicated coconut\n3 Tbsp sugar\n1/2 tsp yeast\nSalt",
    "procedure": "Soak rice and dessicated coconut in water for about 6 hours.Check for rice to turn soft.Add in a blender along with sugar and salt and grind for at least 7 minutes.Add yeast and blend for another 2 minutes.Let the batter rest in a warm area for the batter to rise or refrigerate overnight.Heat a pan and pour a ladle-full of batter at the centre.Twist the pan to get the desired shape, close the lid and cook for about 3 minutes till the ends turn light brown.Serve and enjoy!"
  },
  {
    "index": 1,
    "name" : "Onion Rava Dosa",
    "servings": "Serves 2",
    "totalTime": "55 minutes",
    "ingredients": "1 Cup Rava (semolina)\n1 Cup Rice flour\n3 Green chillies, chopped\n1/2 inch Ginger, grated\n1/2 tsp Black pepper\n1/4 tsp Cumin seeds\nA pinch of Asafoetida\n3 Onions, finely chopped\n3 tsp Cashew nuts (broken), roasted\nTo taste Salt\nOil",
    "procedure": "Mix the rice flour and rava with some water and mix till its a smooth batter. Add the asafoetida, cumin seeds and salt. Cover and keep it in a warm place for a few hours to ferment. Mix the chopped onions, green chillies, ginger, cashew nuts and black pepper in a bowl and keep it aside. Heat a flat pan (tawa) and grease it with a spoon of oil. Add some water in the dosa batter and make it into a thin batter. Pour 1/2 cup of the batter in center of the pan and quickly spread with outward spiral motion to form a thin pancake of about 8 inches in diameter. Sprinkle some onion-green chilli mixture on top of it. Dot the edges with little oil and cook until golden brown. Using a spatula carefully fold the dosa and remove from the pan. Serve hot with chutneys or sambhar."
  },
  {
    "index": 2,
    "name" : "Uttapam",
    "servings": "Serves 2",
    "totalTime": "50 minutes",
    "ingredients": "360 Gram Rice (parboiled)\n90 Gram Bengal Gram (dhuli urad) (split and husked)\n1/2 tsp Fenugreek seeds\n2 tsp Salt\nIron griddle or tawa\nOil",
    "procedure": "Soak rice, daal and methi in water for 5-6 hours. Grind fine, add salt and enough water to make a dropping consistency and leave to ferment 5-6 hours. Heat tawa, and brush oil over it. When really hot, splash a little water over it, and pour about 1 cup of batter on to it. It will spread a little. When the edges start browning a bit, pour a trail of oil around it. Turn it over and let it brown on the other side too.\nBefore you turn the uttapam over, sprinkle a mixture of finely chopped onions, tomatoes, coriander leaves and green chillies. Serve hot."
  },
  {
    "index": 3,
    "name" : "Ven Pongal",
    "servings": "Serves 4",
    "totalTime": "35 minutes",
    "ingredients": "1 Cup Rice\n1/2 Cup Yellow moong dal\n1 tsp Black pepper\n1 Green chilli\n1 Ginger\n1 tsp Cumin seeds\n4 Cup Curry leaves water \nCashew nuts\n200 Gram Ghee\nSalt",
    "procedure": "Pour 100 gm ghee in a pressure cooker. Add rice and moong dal. Fry for 2-3 minutes. Add water and salt. Pressure cook it until 3 whistles .Add the remaining ghee, cashew nuts, black pepper, cumin seeds, green chilli, curry leaves and ginger in a pan. Fry for 1 minute and pour the tadka over the dish. Serve hot with chutney and sambar."
  },
  {
    "index": 4,
    "name" : "Medhu Vada",
    "servings": "Serves 2",
    "totalTime": "45 minutes",
    "ingredients": "1 cup split husked black gram (dhuli urad), soaked for 4-6 hours\n1 tsp salt\n1/4 tsp asafoetida\n1/4 tsp powdered black pepper\n1 Tbsp chopped coriander leaves\n1 tsp finely chopped ginger\n1/2 tsp finely chopped green chillies\nOil",
    "procedure": "Drain the daal and grind to a smooth paste. Add salt, asafoetida and the black pepper, and beat well to make it light and fluffy. Mix in coriander leaves, ginger and the green chillies. Heat oil till a drop of batter dropped in comes up at once. Shape the daal mixture into flat rounds, make a hole in the center and fry, first over high heat, then over lowered heat till brown and cooked through. Lift the vadas out of oil and drain on absorbent paper and serve."
  },
  {
    "index": 5,
    "name" : "Oats Idli",
    "servings": "Serves 2",
    "totalTime": "40 minutes",
    "ingredients": "2 Cups oats\n1/2 litre curd (slightly sour)\n1 tbsp mustard seeds\n1 tbsp urad dal\n1/2 tbsp channa dal\n1/2 tbsp oil\n2 tsp green chillies, finely chopped\n1 cup carrots, grated\n2 tbsp coriander, finely chopped\n1/2 tbsp turmeric powder\n2 tbsp salt\nA pinch of fruit salt",
    "procedure": "On a tawa, dry roast the oats until it turns slightly brown and then powder the oats in a mixer. In a pan, add oil, mustard seeds, urad dal, channa dal and allow the mustard to splutter and the dals to turn golden. To this, add the chopped chillies, coriander and grated carrots. Add the turmeric powder and fry for a minute. Add this seasoning to the powdered oats mixture and add the curd to it to make a batter like that of idli batter's consistency. You can add as much curd to the mixture to achieve the consistency, but do not add water to the batter. Grease the idli steamer plates with oil and pour the batter into each area of the steamer . Steam the idlis for 15 minutes.\nNote: To know if the idli is cooked, poke an idli with knife and check if the batter does not stick to the knife.  Once done remove the idlis and serve with Onion chutney."
  },
  {
    "index": 6,
    "name" : "Rawa Upma",
    "servings": "Serves 2",
    "totalTime": "30 minutes",
    "ingredients": "250 Gram Semolina\n650 Ml Water\n75 Gram Ghee\n5 Gram Mustard seeds\n2 Gram Black gram dal\n2 Gram Bengal gram dal\n100 Gram Onions\n5 Gram Green chillies\n25 Gram Cashew nuts\n2 Gram Curry leaves salt\nCoriander leaves\nCoconut, grated",
    "procedure": "Boil water. Slice onions and cut the chillies lengthwise. Heat a deep pan with ghee. Add mustard, when crackling add the dals and sauté until golden. Add onions, curry leaves, cashew nuts and green chillies. When the onions are translucent add semolina and sauté. Add the boiling water and stir rapidly with the salt. When the moisture is absorbed, the upma is cooked. Mix well and garnish with grated coconut and coriander leaves."
  },
  {
    "index": 7,
    "name": "Tangy Tomato Rice",
    "servings": "Serves 4-6",
    "totalTime": "40 minutes",
    "ingredients": "2 cups cooked Basmati rice (you can also use leftover rice)\n4 large ripe tomatoes cut into cubes\n2 tbsps vegetable, canola, or sunflower cooking oil\n1 tsp mustard seeds\n1 large onion chopped fine\n2 green chilies slit lengthwise\n1-inch piece of ginger grated\n2 tsp coriander powder\n1 tsp cumin powder\n1 tbsp garam masala\nSalt to taste",
    "procedure" : "Heat the oil in a deep pan and add the mustard seeds and green chilies until they stop spluttering. Add the onion and fry until soft. Add the tomato and ginger and mix well. Cook until the tomatoes turn pulpy. Add the coriander, cumin, and garam masala powders. Salt to taste and mix well. Cook on a low flame for 3 to 4 minutes, stirring frequently. Turn off the fire and add the rice. Mix well. Serve with poppadums."
  }
]